thorzhou/FreeRTOS/stm32f429_template/stm32f429_template.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F4
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
PH12.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
ProjectManager.MainLocation=Src
PA0/WKUP.GPIOParameters=GPIO_Label
ProjectManager.ProjectFileName=stm32f429_template.ioc
RCC.CortexFreq_Value=180000000
PH12.Signal=GPIO_Output
PH12.Locked=true
ProjectManager.KeepUserCode=true
PA10.Mode=Asynchronous
Mcu.UserName=STM32F429IGTx
Mcu.PinsNb=14
PH10.Signal=GPIO_Output
PH11.Signal=GPIO_Output
PH12.GPIO_Label=LED_B
ProjectManager.NoMain=false
PH12.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PH10.PinState=GPIO_PIN_SET
PC13.Locked=true
RCC.PLLCLKFreq_Value=180000000
PC13.Signal=GPXTI13
RCC.PLLQCLKFreq_Value=90000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_USART1_UART_Init-USART1-false-HAL-true
PH10.Locked=true
SH.GPXTI0.ConfNb=1
RCC.RTCFreq_Value=32000
PA0/WKUP.Signal=GPXTI0
ProjectManager.DefaultFWLocation=true
RCC.VCOSAIOutputFreq_ValueQ=20416666.666666668
RCC.VCOSAIOutputFreq_ValueR=40833333.333333336
ProjectManager.DeletePrevious=true
USART1.IPParameters=VirtualMode
PC13.GPIO_Label=KEY2
RCC.APB1CLKDivider=RCC_HCLK_DIV4
PinOutPanel.RotationAngle=0
RCC.FamilyName=M
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
SH.GPXTI13.0=GPIO_EXTI13
RCC.SAI_BClocksFreq_Value=20416666.666666668
PA13.Signal=SYS_JTMS-SWDIO
Mcu.IP4=USART1
PH11.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
RCC.FCLKCortexFreq_Value=180000000
I2C1.IPParameters=I2C_Mode,OwnAddress
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP2=RCC
Mcu.IP3=SYS
Mcu.IP0=I2C1
PA9.Mode=Asynchronous
Mcu.IP1=NVIC
Mcu.UserConstants=
PH11.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
ProjectManager.TargetToolchain=MDK-ARM V5
RCC.LCDTFTFreq_Value=20416666.666666668
SH.GPXTI13.ConfNb=1
I2C1.I2C_Mode=I2C_Standard
Mcu.ThirdPartyNb=0
PH0/OSC_IN.Mode=HSE-External-Oscillator
RCC.HCLKFreq_Value=180000000
Mcu.IPNb=5
RCC.I2SClocksFreq_Value=160000000
ProjectManager.PreviousToolchain=
PH11.PinState=GPIO_PIN_SET
RCC.APB2TimFreq_Value=180000000
PA9.Signal=USART1_TX
PH11.GPIO_Label=LED_G
PB6.Signal=I2C1_SCL
RCC.VcooutputI2S=160000000
PA0/WKUP.Locked=true
RCC.VcooutputI2SQ=160000000
PH1/OSC_OUT.Signal=RCC_OSC_OUT
PB6.Mode=I2C
Mcu.Pin6=PH12
Mcu.Pin7=PA9
Mcu.Pin8=PA10
Mcu.Pin9=PA13
RCC.VCOSAIOutputFreq_Value=81666666.66666667
PH11.Locked=true
RCC.LSE_VALUE=32768
RCC.AHBFreq_Value=180000000
Mcu.Pin0=PC13
PH10.GPIO_Label=LED_R
Mcu.Pin1=PH0/OSC_IN
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PH1/OSC_OUT
Mcu.Pin3=PA0/WKUP
Mcu.Pin4=PH10
NVIC.EXTI15_10_IRQn=true\:10\:0\:true\:false\:true\:true\:true
RCC.VCOI2SOutputFreq_Value=320000000
Mcu.Pin5=PH11
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=25000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
board=custom
RCC.VCOOutputFreq_Value=360000000
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.LastFirmware=true
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.25.0
PH0/OSC_IN.Signal=RCC_OSC_IN
MxDb.Version=DB.5.0.60
RCC.APB2Freq_Value=90000000
ProjectManager.BackupPrevious=false
MxCube.Version=5.6.1
RCC.VCOInputFreq_Value=1666666.6666666667
PA14.Mode=Serial_Wire
PC13.GPIOParameters=GPIO_Label
File.Version=6
VP_SYS_VS_Systick.Mode=SysTick
RCC.EthernetFreq_Value=180000000
PA0/WKUP.GPIO_Label=KEY1
PB7.Signal=I2C1_SDA
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=48MHZClocksFreq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,EnbaleCSS,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2SClocksFreq_Value,LCDTFTFreq_Value,LSE_VALUE,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLM,PLLN,PLLQCLKFreq_Value,PLLSourceVirtual,RTCFreq_Value,RTCHSEDivFreq_Value,SAI_AClocksFreq_Value,SAI_BClocksFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value,VCOSAIOutputFreq_ValueQ,VCOSAIOutputFreq_ValueR,VcooutputI2S,VcooutputI2SQ
PH1/OSC_OUT.Mode=HSE-External-Oscillator
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F429I(E-G)Tx
ProjectManager.HalAssertFull=false
RCC.RTCHSEDivFreq_Value=12500000
ProjectManager.ProjectName=stm32f429_template
ProjectManager.UnderRoot=false
I2C1.OwnAddress=5
ProjectManager.CoupleFile=true
RCC.48MHZClocksFreq_Value=90000000
RCC.MCO2PinFreq_Value=180000000
NVIC.EXTI0_IRQn=true\:9\:0\:true\:false\:true\:true\:true
PH10.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
RCC.SYSCLKFreq_VALUE=180000000
Mcu.Package=LQFP176
PH10.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
RCC.EnbaleCSS=true
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
USART1.VirtualMode=VM_ASYNC
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PB7.Mode=I2C
SH.GPXTI0.0=GPIO_EXTI0
PH12.PinState=GPIO_PIN_SET
PA10.Signal=USART1_RX
PA14.Signal=SYS_JTCK-SWCLK
ProjectManager.HeapSize=0x200
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin13=VP_SYS_VS_Systick
ProjectManager.ComputerToolchain=false
RCC.HSI_VALUE=16000000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
RCC.APB2CLKDivider=RCC_HCLK_DIV2
Mcu.Pin11=PB6
Mcu.Pin12=PB7
RCC.PLLM=15
RCC.PLLN=216
Mcu.Pin10=PA14
RCC.APB1TimFreq_Value=90000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.APB1Freq_Value=45000000
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DeviceId=STM32F429IGTx
ProjectManager.LibraryCopy=0
RCC.SAI_AClocksFreq_Value=20416666.666666668
